spec/cassettes/Create_payment_on_successful_charge/create_the_payment_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_1AW947LtUmfCvvw0wewg7OdV
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer sk_test_EP6KmQMbZiQ2akIbzKW7aG72
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.3.4 p301 (2017-03-30)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Jamess-MacBook-Pro.local 16.6.0 Darwin Kernel Version 16.6.0: Fri Apr 14 16:21:16
        PDT 2017; root:xnu-3789.60.24~6/RELEASE_X86_64 x86_64","hostname":"Jamess-MacBook-Pro.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 19 Jun 2017 20:15:54 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2396'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AsGpZUiVD6kuGr
      Stripe-Version:
      - '2017-06-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_1AW947LtUmfCvvw0wewg7OdV",
          "object": "event",
          "api_version": "2017-06-05",
          "created": 1497814087,
          "data": {
            "object": {
              "id": "ch_1AW947LtUmfCvvw0prHhKvBh",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application": null,
              "application_fee": null,
              "balance_transaction": "txn_1AW947LtUmfCvvw0KSDpFDmQ",
              "captured": true,
              "created": 1497814087,
              "currency": "usd",
              "customer": "cus_ArspDj2GhJrNZ6",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_1AW947LtUmfCvvw0tf78ymil",
              "livemode": false,
              "metadata": {},
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_1AW947LtUmfCvvw0prHhKvBh/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_1AW945LtUmfCvvw0adfyI6jn",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "21321",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_ArspDj2GhJrNZ6",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 4,
                "exp_year": 2024,
                "fingerprint": "SzhLE0ATgPling4i",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "succeeded",
              "transfer_group": null
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": {
            "id": "req_ArspZkVh9mVvgc",
            "idempotency_key": null
          },
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Mon, 19 Jun 2017 20:15:54 GMT
recorded_with: VCR 3.0.3
